re-former/app/controllers/users_controller.rb

  def create
    # form_tag version
    # @user = User.new(username: params[:username], email: params[:email], password: params[:password])
    # @user = User.new(user: params[:user]) #Hash cannot be directly used

    # form_for version
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "ddsdd"], ["email", "ff@gmail.com"], ["password", "tttt"], ["created_at", "2020-05-13 15:29:37.908811"], ["updated_at", "2020-05-13 15:29:37.908811"]]

  def update
    @user = User.find(params[:id])
    @user.update(user_params)
    if @user.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "password" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password", "dddd"], ["email", "help2232@gmail.com"], ["updated_at", "2020-05-14 14:54:46.682367"], ["id", 2]]
UPDATE "users" SET "password" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password", "ddd"], ["email", "323@gmail.com"], ["updated_at", "2020-05-14 14:27:46.553992"], ["id", 2]]